<html>
<head>
<title>Le Livre d'Ymir :: site de ressources en français pour Ragnarok Online</title>
</head>
<body bgcolor="#EAEDF4" marginwidth="0" marginheight="0" leftmargin="0" topmargin="0">
<p align="center"><font face="Arial, Helvetica, sans-serif"><a href="http://bookofymir.free.fr"><img src="images/bookofymir.jpg" width="400" height="192" border="0"></a></font></p>
<p align="center"><font face="Arial, Helvetica, sans-serif"><a href="http://elfangelis.fr/bookofymir/boy/scripts_custom/boy_ctf.txt"><img src="images/ctf.jpg" width="222" height="100" border="0"></a></font></p>
<p><font face="Arial, Helvetica, sans-serif" size="3"><strong>Par</strong>:<font color="#990000"><em><strong> Cid</strong></em></font></font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"><strong>Description</strong>: 
Jeu de Capture De Drapeaux (Capture The Flag) entre deux &eacute;quipes.</font></p>
<p align="left"><font size="2" face="Arial, Helvetica, sans-serif"><strong>N&eacute;cessite l'emploi d'une map custom</strong> (voir <a href="#mapcustom">ci-dessous</a>) </font></p>
<p align="left"><font size="2" face="Arial, Helvetica, sans-serif"><strong>N&eacute;cessite l'emploi de sons wav customs</strong> (voir <a href="#wavcustom">ci-dessous</a>) </font></p>
<p align="left"><font size="2" face="Arial, Helvetica, sans-serif"><strong>Fait appel &agrave; un <a href="images/CTFBOY.jpg">cuttin custom</a> </strong>(que vous pouvez modifier &agrave; votre guise).<br>
  <br>
  <strong>Description &eacute;tendue</strong>: </font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Le jeu fait s'affronter deux &eacute;quipes sur un terrain adapt&eacute; (voir map custom cr&eacute;&eacute;e &agrave; cette occasion). Chaque &eacute;quipe poss&egrave;de une base dans laquelle se trouve un drapeau &agrave; la couleur de l'&eacute;quipe. Le but du jeu est de r&eacute;cup&eacute;rer le drapeau ennemi dans la base ennemie puis de le rapporter dans sa propre base. Ceci a pour effet de marquer un point. On doit donc prendre le drapeau de l'&eacute;quipe adverse, et le ramener dans son camp.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Pour s'inscrire il faut &ecirc;tre dans une party. Seul le chef de l'&eacute;quipe peut inscrire son &eacute;quipe, et commencer le match.Deux types de matchs sont disponibles: match &agrave; points ou match &agrave; temps. Des paris sont &eacute;galement possibles.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">A noter &agrave; propos du syst&egrave;me d'inscription:</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">-&gt; Les joueurs normaux ne peuvent rien faire avec le NPC et n'ont pas besoin de lui parler.<br>
  -&gt; Le chef de la party s'inscrit une fois pour toute son &eacute;quipe.<br>
  -&gt; Si le chef se d&eacute;connecte, toute l'&eacute;quipe est annul&eacute;e.<br>
  -&gt; Si un joueur est /invite apr&egrave;s l'inscription de l'&eacute;quipe, le NPC le signale mais il y a toujours moyen de lancer la partie (le nouveau joueur ne sera pas dans la partie sauf d&eacute;sinscription/r&eacute;inscription).</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Pour d'autres informations concernant les configurations possibles et les variables utilis&eacute;es, se reporter au header du script.</font></p>
<p><font face="arial" size="2"><strong><font size="2" face="arial"><strong><a name="mapcustom"></a></strong></font><font color="#FF0000">Si vous souhaitez utiliser ce script, une map custom doit &ecirc;tre utilis&eacute;e.</font></strong> Il s'agit d'une map sp&eacute;cialement cr&eacute;&eacute;e pour cet event par Clad et disponible dans le r&eacute;pertoire <a href="http://elfangelis.fr/bookofymir/boy/maps_custom/">maps_custom</a>. Apper&ccedil;u:</font></p>
<p align="center"><img src="images/dot_ctf3.jpg" width="1009" height="516"></p>
<p align="center"><img src="images/dot_ctf4.jpg" width="920" height="935"></p>
<p align="center"><img src="images/dot_ctf.jpg" width="1009" height="516"></p>
<p align="center"><img src="images/dot_ctf1.jpg" width="1009" height="516"></p>
<p align="center"><img src="images/dot_ctf2.jpg" width="1009" height="516"></p>
<p align="center"><img src="images/dot_ctf1_chateau.jpg" width="1009" height="516"></p>
<p align="left"><font face="arial" size="2"><strong><font size="2" face="arial"><strong><a name="wavcustom"></a></strong></font><font color="#FF0000">Si vous souhaitez utiliser ce script, certains sons wav customs doivent &ecirc;tre utilis&eacute;s.</font></strong> Ils sont disponibles, ainsi qu'une BGM choisie par nos soins, dans le r&eacute;pertoire <a href="http://elfangelis.fr/bookofymir/boy/data_custom/">data_custom</a>. Vous pouvez aussi les <a href="http://elfangelis.fr/bookofymir/boy/data_custom/data_ctf.rar">télécharger directement</a>.</font></p>
<p>&nbsp;</p>
</body>
</html>

